# GetFName

## Description
Function GetFName returns the current file name of the active document.

```pascal
FUNCTION GetFName : STRING;
```

```python
def vs.GetFName():
    return STRING
```

## Remarks
See also: [[VS:GetFPathName]], which returns the fully qualified path of the active document.

## Version
Availability: from All Versions

## Category
* Document Settings